{
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "O",
    "1": "direct",
    "2": "indirect",
    "3": "reported",
    "4": "freeIndirect"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "O": 0,
    "direct": 1,
    "freeIndirect": 4,
    "indirect": 2,
    "reported": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 10,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 30522
}
